Revit 2027 API
CurveElementFilter.CurveElementType Property
 The curve element type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveElementType CurveElementType { get; }
Public ReadOnly Property CurveElementType As CurveElementType
	Get
public:
property CurveElementType CurveElementType {
	CurveElementType get ();
}
member CurveElementType : CurveElementType with get
Property Value
CurveElementType
See Also
Reference
CurveElementFilter Class
Autodesk.Revit.DB Namespace